###################################################################

# Created by write_sdc on Mon Jan 21 19:51:16 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
set_load -pin_load 0.3 [get_ports {F_Data[31]}]
set_load -pin_load 0.3 [get_ports {F_Data[30]}]
set_load -pin_load 0.3 [get_ports {F_Data[29]}]
set_load -pin_load 0.3 [get_ports {F_Data[28]}]
set_load -pin_load 0.3 [get_ports {F_Data[27]}]
set_load -pin_load 0.3 [get_ports {F_Data[26]}]
set_load -pin_load 0.3 [get_ports {F_Data[25]}]
set_load -pin_load 0.3 [get_ports {F_Data[24]}]
set_load -pin_load 0.3 [get_ports {F_Data[23]}]
set_load -pin_load 0.3 [get_ports {F_Data[22]}]
set_load -pin_load 0.3 [get_ports {F_Data[21]}]
set_load -pin_load 0.3 [get_ports {F_Data[20]}]
set_load -pin_load 0.3 [get_ports {F_Data[19]}]
set_load -pin_load 0.3 [get_ports {F_Data[18]}]
set_load -pin_load 0.3 [get_ports {F_Data[17]}]
set_load -pin_load 0.3 [get_ports {F_Data[16]}]
set_load -pin_load 0.3 [get_ports {F_Data[15]}]
set_load -pin_load 0.3 [get_ports {F_Data[14]}]
set_load -pin_load 0.3 [get_ports {F_Data[13]}]
set_load -pin_load 0.3 [get_ports {F_Data[12]}]
set_load -pin_load 0.3 [get_ports {F_Data[11]}]
set_load -pin_load 0.3 [get_ports {F_Data[10]}]
set_load -pin_load 0.3 [get_ports {F_Data[9]}]
set_load -pin_load 0.3 [get_ports {F_Data[8]}]
set_load -pin_load 0.3 [get_ports {F_Data[7]}]
set_load -pin_load 0.3 [get_ports {F_Data[6]}]
set_load -pin_load 0.3 [get_ports {F_Data[5]}]
set_load -pin_load 0.3 [get_ports {F_Data[4]}]
set_load -pin_load 0.3 [get_ports {F_Data[3]}]
set_load -pin_load 0.3 [get_ports {F_Data[2]}]
set_load -pin_load 0.3 [get_ports {F_Data[1]}]
set_load -pin_load 0.3 [get_ports {F_Data[0]}]
set_load -pin_load 0.3 [get_ports F_FullN]
set_load -pin_load 0.3 [get_ports F_LastN]
set_load -pin_load 0.3 [get_ports F_SLastN]
set_load -pin_load 0.3 [get_ports F_FirstN]
set_load -pin_load 0.3 [get_ports F_EmptyN]
create_clock [get_ports Clk]  -name ideal_clock1  -period 5  -waveform {0 2.5}
set_input_delay -clock ideal_clock1  2  [get_ports RstN]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[31]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[30]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[29]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[28]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[27]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[26]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[25]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[24]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[23]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[22]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[21]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[20]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[19]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[18]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[17]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[16]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[15]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[14]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[13]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[12]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[11]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[10]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[9]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[8]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[7]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[6]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[5]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[4]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[3]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[2]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[1]}]
set_input_delay -clock ideal_clock1  2  [get_ports {Data_In[0]}]
set_input_delay -clock ideal_clock1  2  [get_ports FClrN]
set_input_delay -clock ideal_clock1  2  [get_ports FInN]
set_input_delay -clock ideal_clock1  2  [get_ports FOutN]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[31]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[30]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[29]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[28]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[27]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[26]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[25]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[24]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[23]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[22]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[21]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[20]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[19]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[18]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[17]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[16]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[15]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[14]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[13]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[12]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[11]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[10]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[9]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[8]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[7]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[6]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[5]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[4]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[3]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[2]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[1]}]
set_output_delay -clock ideal_clock1  2  [get_ports {F_Data[0]}]
set_output_delay -clock ideal_clock1  2  [get_ports F_FullN]
set_output_delay -clock ideal_clock1  2  [get_ports F_LastN]
set_output_delay -clock ideal_clock1  2  [get_ports F_SLastN]
set_output_delay -clock ideal_clock1  2  [get_ports F_FirstN]
set_output_delay -clock ideal_clock1  2  [get_ports F_EmptyN]
