###################################################################

# Created by write_sdc on Sun May 19 22:45:43 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[7]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[6]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[5]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[4]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[3]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[2]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[1]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_req_cq[0]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[144]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[143]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[142]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[141]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[140]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[139]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[138]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[137]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[136]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[135]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[134]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[133]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[132]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[131]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[130]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[129]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[128]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[127]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[126]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[125]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[124]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[123]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[122]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[121]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[120]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[119]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[118]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[117]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[116]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[115]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[114]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[113]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[112]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[111]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[110]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[109]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[108]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[107]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[106]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[105]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[104]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[103]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[102]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[101]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[100]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[99]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[98]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[97]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[96]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[95]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[94]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[93]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[92]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[91]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[90]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[89]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[88]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[87]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[86]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[85]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[84]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[83]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[82]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[81]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[80]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[79]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[78]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[77]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[76]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[75]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[74]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[73]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[72]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[71]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[70]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[69]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[68]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[67]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[66]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[65]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[64]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[63]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[62]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[61]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[60]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[59]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[58]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[57]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[56]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[55]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[54]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[53]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[52]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[51]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[50]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[49]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[48]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[47]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[46]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[45]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[44]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[43]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[42]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[41]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[40]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[39]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[38]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[37]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[36]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[35]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[34]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[33]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[32]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[31]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[30]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[29]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[28]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[27]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[26]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[25]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[24]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[23]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[22]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[21]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[20]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[19]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[18]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[17]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[16]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[15]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[14]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[13]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[12]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[11]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[10]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[9]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[8]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[7]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[6]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[5]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[4]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[3]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[2]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[1]}]
set_load -pin_load 0.01 [get_ports {fp_cpx_data_ca[0]}]
set_load -pin_load 0.01 [get_ports so]
create_clock [get_ports gclk]  -name ideal_clock  -period 75  -waveform {0 37.5}
set_clock_latency -max 0.01  [get_clocks ideal_clock]
set_clock_uncertainty 0.01  [get_clocks ideal_clock]
