###################################################################

# Created by write_sdc on Wed Mar  6 02:45:34 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
set_load -pin_load 0.3 [get_ports CRC_OUT_1_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_1_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_2_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_3_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_4_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_5_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_6_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_7_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_8_9]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_0]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_1]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_10]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_11]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_12]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_13]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_14]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_15]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_16]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_17]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_18]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_19]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_2]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_20]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_21]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_22]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_23]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_24]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_25]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_26]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_27]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_28]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_29]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_3]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_30]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_31]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_4]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_5]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_6]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_7]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_8]
set_load -pin_load 0.3 [get_ports CRC_OUT_9_9]
set_load -pin_load 0.3 [get_ports DATA_9_0]
set_load -pin_load 0.3 [get_ports DATA_9_1]
set_load -pin_load 0.3 [get_ports DATA_9_10]
set_load -pin_load 0.3 [get_ports DATA_9_11]
set_load -pin_load 0.3 [get_ports DATA_9_12]
set_load -pin_load 0.3 [get_ports DATA_9_13]
set_load -pin_load 0.3 [get_ports DATA_9_14]
set_load -pin_load 0.3 [get_ports DATA_9_15]
set_load -pin_load 0.3 [get_ports DATA_9_16]
set_load -pin_load 0.3 [get_ports DATA_9_17]
set_load -pin_load 0.3 [get_ports DATA_9_18]
set_load -pin_load 0.3 [get_ports DATA_9_19]
set_load -pin_load 0.3 [get_ports DATA_9_2]
set_load -pin_load 0.3 [get_ports DATA_9_20]
set_load -pin_load 0.3 [get_ports DATA_9_21]
set_load -pin_load 0.3 [get_ports DATA_9_22]
set_load -pin_load 0.3 [get_ports DATA_9_23]
set_load -pin_load 0.3 [get_ports DATA_9_24]
set_load -pin_load 0.3 [get_ports DATA_9_25]
set_load -pin_load 0.3 [get_ports DATA_9_26]
set_load -pin_load 0.3 [get_ports DATA_9_27]
set_load -pin_load 0.3 [get_ports DATA_9_28]
set_load -pin_load 0.3 [get_ports DATA_9_29]
set_load -pin_load 0.3 [get_ports DATA_9_3]
set_load -pin_load 0.3 [get_ports DATA_9_30]
set_load -pin_load 0.3 [get_ports DATA_9_31]
set_load -pin_load 0.3 [get_ports DATA_9_4]
set_load -pin_load 0.3 [get_ports DATA_9_5]
set_load -pin_load 0.3 [get_ports DATA_9_6]
set_load -pin_load 0.3 [get_ports DATA_9_7]
set_load -pin_load 0.3 [get_ports DATA_9_8]
set_load -pin_load 0.3 [get_ports DATA_9_9]
create_clock [get_ports CK]  -name ideal_clock1  -period 10  -waveform {0 5}
set_input_delay -clock ideal_clock1  2  [get_ports GND]
set_input_delay -clock ideal_clock1  2  [get_ports VDD]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_0]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_1]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_10]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_11]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_12]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_13]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_14]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_15]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_16]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_17]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_18]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_19]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_2]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_20]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_21]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_22]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_23]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_24]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_25]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_26]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_27]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_28]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_29]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_3]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_30]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_31]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_4]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_5]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_6]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_7]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_8]
set_input_delay -clock ideal_clock1  2  [get_ports DATA_0_9]
set_input_delay -clock ideal_clock1  2  [get_ports RESET]
set_input_delay -clock ideal_clock1  2  [get_ports TM0]
set_input_delay -clock ideal_clock1  2  [get_ports TM1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_1_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_2_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_3_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_4_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_5_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_6_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_7_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_8_9]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_0]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_1]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_10]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_11]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_12]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_13]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_14]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_15]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_16]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_17]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_18]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_19]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_2]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_20]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_21]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_22]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_23]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_24]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_25]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_26]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_27]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_28]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_29]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_3]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_30]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_31]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_4]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_5]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_6]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_7]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_8]
set_output_delay -clock ideal_clock1  2  [get_ports CRC_OUT_9_9]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_0]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_1]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_10]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_11]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_12]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_13]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_14]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_15]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_16]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_17]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_18]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_19]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_2]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_20]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_21]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_22]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_23]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_24]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_25]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_26]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_27]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_28]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_29]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_3]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_30]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_31]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_4]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_5]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_6]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_7]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_8]
set_output_delay -clock ideal_clock1  2  [get_ports DATA_9_9]
set_clock_latency 0.4  [get_ports CK]
